# https://github.com/Homebrew/homebrew-bundle for docs

######## Utilities ########
brew "direnv"
brew "fzf"
tap "instrumenta/instrumenta"
brew "kubeval"
brew "bash-completion"
brew "git"
brew "sops"
brew "watch"
brew "openssl"
brew "wget"
brew "parallel"

######## Kubernetes ########
brew "minikube"
brew "FairwindsOps/tap/rbac-lookup" # find Kubernetes roles and cluster roles bound to any user
brew "helm"
brew "kubernetes-cli" # kubectl
brew "k9s"
brew "kubectx"

######## SRE Core ########
brew "kustomize"
brew "argocd"
brew "dockerize" # for backstage
brew "tfenv"

######## Ruby ########
brew "ruby"
brew "rbenv"

######## Node ########
brew "nodenv"
brew "yarn"

######## Casks ########
# casks error on reinstall, comment them out to re-run script

cask "iterm2"
cask "postman"
cask "textmate"
cask "visual-studio-code"
cask "cheatsheet"
cask "meld"
cask "spectacle"
cask "ngrok" # turns localhost into something you can hit with a webhook
cask "spotify"
cask "slack"
