# https://github.com/Homebrew/homebrew-bundle for docs

######## Utilities ########
brew "fzf"
brew "git"
brew "sops"
brew "watch"
brew "openssl"
brew "wget"
brew "parallel"
brew "tfenv"
brew "wg"
brew "jq"
brew "gnupg"

######## Kubernetes ########
brew "minikube"
brew "FairwindsOps/tap/rbac-lookup" # find Kubernetes roles and cluster roles bound to any user
brew "helm"
brew "kubernetes-cli" # kubectl
brew "k9s"
brew "kubectx"
brew "kustomize"
brew "krew" # package manager for kubectl plugins
brew "pluto" #CLI tool to help discover deprecated apiVersions in Kubernetes

######## GCLOUD ########
brew "google-cloud-sdk"

######## Python ########
brew "pyenv"
brew "pyenv-virtualenv"

######## Ruby ########
# brew "ruby"
# brew "rbenv"

######## Node ########
# brew "nodenv"
# brew "yarn"

######## Casks ########
cask "iterm2"
cask "textmate"
cask "visual-studio-code"
cask "cheatsheet"
cask "meld" # visual diff and merge tool
cask "rectangle"
cask "ngrok" # turns localhost into something you can hit with a webhook
cask "spotify"
# cask "slack" # anything installed outside of brew will error out b/c the application already exists
cask "docker"

######## Recursion ########
brew "grpc"
brew "pinentry"
brew "pinentry-mac"
brew "argocd"
cask "mob"
cask "lens"