######## Utilities ########
brew "direnv"
brew "fzf"
brew "kubeval"
brew "bash-completion"
brew "git"
brew "sops"
brew "watch"
brew "openssl"
brew "wget"

######## Kubernetes ########
brew "minikube"
brew "rbac-lookup" # find Kubernetes roles and cluster roles bound to any user
brew "helm"
brew "kubernetes-cli" # kubectl
brew "k9s"
brew "kubectx"

######## SRE Core ########
brew "kustomize"
brew "argocd"
brew "dockerize" # for backstage
brew "tfenv"

######## Ruby ########
brew "ruby"
brew "rbenv"

######## Node ########
brew "nodenv"
brew "yarn"

######## DB ########
brew "redis"
brew "postgresql"
brew "sqlite"

######## Casks ########
# casks error on reinstall, comment them out to re-run script

# cask "alfred"
# cask "iterm2"
# cask "postman"
# cask "textmate"
# cask "visual-studio-code"
# cask "cheatsheet"
# cask "vlc"
# cask "firefox"
# cask "meld"
# cask "spectacle"
# cask "insomnia"
# cask "ngrok" # turns localhost into something you can hit with a webhook
# cask "spotify"
